Revit 2026 API

# EnergyAnalysisSurfaceSurfaceId Property

---

The unique identifier for the surface.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string SurfaceId { get; }
```
```vb
Public ReadOnly Property SurfaceId As String
	Get
```
```cpp
public:
property String^ SurfaceId {
	String^ get ();
}
```
```fsharp
member SurfaceId : string with get
```

#### Property Value

String

This identification attribute is composed of the prefix "su" and a sequential number, separated by "-". A sample value would be "su-1".

#### Reference

EnergyAnalysisSurface Class

Autodesk.Revit.DB.Analysis Namespace